docs/test/results/20260321/k6/comment-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_capacity.js
        output: -

     scenarios: (100.00%) 1 scenario, 120 max VUs, 40s max duration (incl. graceful stop):
              * stepped_capacity: Up to 120 looping VUs for 35s over 5 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (01.0s), 013/120 VUs, 356 complete and 0 interrupted iterations
stepped_capacity   [   3% ] 013/120 VUs  01.0s/35.0s

running (02.0s), 017/120 VUs, 771 complete and 0 interrupted iterations
stepped_capacity   [   6% ] 017/120 VUs  02.0s/35.0s

running (03.0s), 021/120 VUs, 1195 complete and 0 interrupted iterations
stepped_capacity   [   8% ] 021/120 VUs  03.0s/35.0s

running (04.0s), 025/120 VUs, 1769 complete and 0 interrupted iterations
stepped_capacity   [  11% ] 025/120 VUs  04.0s/35.0s

running (05.0s), 029/120 VUs, 2354 complete and 0 interrupted iterations
stepped_capacity   [  14% ] 029/120 VUs  05.0s/35.0s

running (06.0s), 035/120 VUs, 3000 complete and 0 interrupted iterations
stepped_capacity   [  17% ] 035/120 VUs  06.0s/35.0s

running (07.0s), 041/120 VUs, 3733 complete and 0 interrupted iterations
stepped_capacity   [  20% ] 041/120 VUs  07.0s/35.0s

running (08.0s), 047/120 VUs, 4403 complete and 0 interrupted iterations
stepped_capacity   [  23% ] 047/120 VUs  08.0s/35.0s

running (09.0s), 053/120 VUs, 5056 complete and 0 interrupted iterations
stepped_capacity   [  26% ] 053/120 VUs  09.0s/35.0s

running (10.0s), 059/120 VUs, 5700 complete and 0 interrupted iterations
stepped_capacity   [  28% ] 059/120 VUs  10.0s/35.0s

running (11.0s), 065/120 VUs, 6478 complete and 0 interrupted iterations
stepped_capacity   [  31% ] 065/120 VUs  11.0s/35.0s

running (12.0s), 071/120 VUs, 7138 complete and 0 interrupted iterations
stepped_capacity   [  34% ] 071/120 VUs  12.0s/35.0s

running (13.0s), 077/120 VUs, 7816 complete and 0 interrupted iterations
stepped_capacity   [  37% ] 077/120 VUs  13.0s/35.0s

running (14.0s), 083/120 VUs, 8706 complete and 0 interrupted iterations
stepped_capacity   [  40% ] 083/120 VUs  14.0s/35.0s

running (15.8s), 089/120 VUs, 9607 complete and 0 interrupted iterations
stepped_capacity   [  43% ] 089/120 VUs  15.0s/35.0s

running (18.3s), 095/120 VUs, 10562 complete and 0 interrupted iterations
stepped_capacity   [  46% ] 095/120 VUs  16.0s/35.0s

running (19.3s), 101/120 VUs, 11502 complete and 0 interrupted iterations
stepped_capacity   [  48% ] 101/120 VUs  17.0s/35.0s

running (20.3s), 107/120 VUs, 12378 complete and 0 interrupted iterations
stepped_capacity   [  51% ] 107/120 VUs  18.0s/35.0s

running (21.3s), 113/120 VUs, 13220 complete and 0 interrupted iterations
stepped_capacity   [  54% ] 113/120 VUs  19.0s/35.0s

running (22.3s), 119/120 VUs, 13981 complete and 0 interrupted iterations
stepped_capacity   [  57% ] 119/120 VUs  20.0s/35.0s

running (23.3s), 114/120 VUs, 14706 complete and 0 interrupted iterations
stepped_capacity   [  60% ] 114/120 VUs  21.0s/35.0s

running (24.3s), 105/120 VUs, 15548 complete and 0 interrupted iterations
stepped_capacity   [  63% ] 105/120 VUs  22.0s/35.0s

running (25.3s), 097/120 VUs, 16465 complete and 0 interrupted iterations
stepped_capacity   [  66% ] 097/120 VUs  23.0s/35.0s

running (26.3s), 089/120 VUs, 17432 complete and 0 interrupted iterations
stepped_capacity   [  68% ] 089/120 VUs  24.0s/35.0s

running (27.3s), 081/120 VUs, 18384 complete and 0 interrupted iterations
stepped_capacity   [  71% ] 081/120 VUs  25.0s/35.0s

running (28.3s), 073/120 VUs, 19353 complete and 0 interrupted iterations
stepped_capacity   [  74% ] 073/120 VUs  26.0s/35.0s

running (29.3s), 065/120 VUs, 20362 complete and 0 interrupted iterations
stepped_capacity   [  77% ] 065/120 VUs  27.0s/35.0s

running (30.3s), 057/120 VUs, 21257 complete and 0 interrupted iterations
stepped_capacity   [  80% ] 057/120 VUs  28.0s/35.0s

running (31.3s), 049/120 VUs, 22280 complete and 0 interrupted iterations
stepped_capacity   [  83% ] 049/120 VUs  29.0s/35.0s

running (32.3s), 041/120 VUs, 23139 complete and 0 interrupted iterations
stepped_capacity   [  86% ] 041/120 VUs  30.0s/35.0s

running (33.3s), 033/120 VUs, 23984 complete and 0 interrupted iterations
stepped_capacity   [  88% ] 033/120 VUs  31.0s/35.0s

running (34.3s), 025/120 VUs, 24865 complete and 0 interrupted iterations
stepped_capacity   [  91% ] 025/120 VUs  32.0s/35.0s

running (35.3s), 017/120 VUs, 25656 complete and 0 interrupted iterations
stepped_capacity   [  94% ] 017/120 VUs  33.0s/35.0s

running (36.3s), 009/120 VUs, 26168 complete and 0 interrupted iterations
stepped_capacity   [  97% ] 009/120 VUs  34.0s/35.0s

running (37.3s), 001/120 VUs, 26640 complete and 0 interrupted iterations
stepped_capacity   [ 100% ] 001/120 VUs  35.0s/35.0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=176.53ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 26647   713.875714/s
    checks_succeeded...: 100.00% 26647 out of 26647
    checks_failed......: 0.00%   0 out of 26647

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=87.41ms min=5.82ms med=73.25ms max=1.74s    p(90)=144.77ms p(95)=176.53ms p(99)=313.51ms
      { expected_response:true }...: avg=87.41ms min=5.82ms med=73.25ms max=1.74s    p(90)=144.77ms p(95)=176.53ms p(99)=313.51ms
    http_req_failed................: 0.00%  0 out of 26647
    http_reqs......................: 26647  713.875714/s

    EXECUTION
    iteration_duration.............: avg=79.8ms  min=5.89ms med=73.3ms  max=578.61ms p(90)=142.34ms p(95)=171.75ms p(99)=249.94ms
    iterations.....................: 26647  713.875714/s
    vus............................: 1      min=1          max=119
    vus_max........................: 120    min=120        max=120

    NETWORK
    data_received..................: 42 MB  1.1 MB/s
    data_sent......................: 3.7 MB 99 kB/s



running (37.3s), 000/120 VUs, 26647 complete and 0 interrupted iterations
stepped_capacity ✓ [ 100% ] 000/120 VUs  35s